#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # linode_domain.master_domain will be created
  + resource "linode_domain" "master_domain" {
      + domain    = "devopswithbrian.com"
      + id        = (known after apply)
      + soa_email = "brianhh1230@gmail.com"
      + status    = (known after apply)
      + tags      = [
          + "prod",
        ]
      + type      = "master"
    }

  # linode_domain_record.github_cname will be created
  + resource "linode_domain_record" "github_cname" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "www"
      + record_type = "CNAME"
      + target      = "devops-with-brian.github.io"
    }

  # linode_domain_record.github_pages[0] will be created
  + resource "linode_domain_record" "github_pages" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "devopswithbrian.com"
      + record_type = "A"
      + target      = "185.199.108.153"
    }

  # linode_domain_record.github_pages[1] will be created
  + resource "linode_domain_record" "github_pages" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "devopswithbrian.com"
      + record_type = "A"
      + target      = "185.199.109.153"
    }

  # linode_domain_record.github_pages[2] will be created
  + resource "linode_domain_record" "github_pages" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "devopswithbrian.com"
      + record_type = "A"
      + target      = "185.199.110.153"
    }

  # linode_domain_record.github_pages[3] will be created
  + resource "linode_domain_record" "github_pages" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "devopswithbrian.com"
      + record_type = "A"
      + target      = "185.199.111.153"
    }

  # linode_domain_record.rasa_dns_record will be created
  + resource "linode_domain_record" "rasa_dns_record" {
      + domain_id   = (known after apply)
      + id          = (known after apply)
      + name        = "rasa"
      + record_type = "A"
      + target      = "139.144.241.120"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @btotharye, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/pr_workflow.yml`*